#### Ejercicio Limpieza de Datos en Pandas 1
Dada una tabla (Diccionario) de ventas que contiene información sobre productos vendidos, incluyendo ID, Producto, Cantidad y Precio,

In [1]:
import pandas as pd

In [2]:
data = {
    'ID': [1, 2, 3, 4, 5],
    'Producto': ['Producto A', 'Producto B', None, 'Producto D', 'Producto E'],
    'Cantidad': [10, 20, 30, None, 50],
    'Precio': [100, 200, 300, 400, None]
}

In [9]:
df = pd.DataFrame(data)

# Contar nulos por columnas
df.isnull().sum()

ID          0
Producto    1
Cantidad    1
Precio      1
dtype: int64

#### Ejercicio Limpieza de Datos en Pandas 2
El conjunto de datos proporcionado tiene algunas entradas duplicadas.
Escribe un script en Python usando Pandas para eliminar las filas duplicadas en el conjunto de datos. Almacena el resultado en una variable llamada: df_sin_duplicados

In [13]:
data2 = {
    'ID': [1, 2, 3, 4, 1],
    'Producto': ['Producto A', 'Producto B', 'Producto C', 'Producto D', 'Producto A'],
    'Cantidad': [10, 20, 30, 40, 50],
    'Precio': [100, 200, 300, 400, 100]
}
df2 = pd.DataFrame(data2)

df_sin_duplicados = df2.drop_duplicates(subset=['Producto'])

df_sin_duplicados

   ID    Producto  Cantidad  Precio
0   1  Producto A        10     100
1   2  Producto B        20     200
2   3  Producto C        30     300
3   4  Producto D        40     400

#### Ejercicio Limpieza de Datos en Pandas 3
Tu tabla de ventas, la columna "Precio" tiene algunos valores nulos.
Escribe un código en Python usando Pandas para reemplazar los valores nulos en la columna Precio por el promedio de los precios no nulos de esa columna.

In [16]:
data3 = {
    'ID': [1, 2, 3, 4],
    'Producto': ['Producto A', 'Producto B', 'Producto C', 'Producto D'],
    'Cantidad': [10, 20, 30, 40],
    'Precio': [100, None, 300, None]
}

df3 = pd.DataFrame(data3)

valores_nuevos = {'Cantidad': 0 , 'Precio' : df3.Precio.mean()}
df_rellenados = df3.fillna(valores_nuevos)
df_rellenados

   ID    Producto  Cantidad  Precio
0   1  Producto A        10   100.0
1   2  Producto B        20   200.0
2   3  Producto C        30   300.0
3   4  Producto D        40   200.0